src/main/test/supply-chain/5-Smoke Tests/0-Apply Tax/0-Validation/1-TC01.01.05.14_Fillup_all/0-TC01.01.05.14_Fillup_all/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax> <arg0><DocumentId>
    <SystemSourceId>ICI001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>03_37_1</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
   
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
  
      <SellerLocalTaxCurrencyCode/>
    
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel/>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>701041103</ItemNo>
      <ItemType>ART</ItemType>
      <UNSPSC>56000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <NetAmount>8.00</NetAmount>
     
    </TaxInvoiceLine>
    <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>701041103</ItemNo>
      <ItemType>ART</ItemType>
      <UNSPSC>78000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <NetAmount>8.00</NetAmount>
     
    </TaxInvoiceLine>
    <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>701041103</ItemNo>
      <ItemType>ART</ItemType>
      <UNSPSC>30000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <NetAmount>8.00</NetAmount>
      
    </TaxInvoiceLine>
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2014-04-07</TaxAlgorithmDate>
    <TaxCalculationDate>2014-04-07</TaxCalculationDate>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation/>
    <SkipDecision/>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>7008</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>7021</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode>7009</CarrierBusinessUnitCode>
    <CarrierBusinessUnitType>COM</CarrierBusinessUnitType>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose/>
    <IsOutBonded/>
    <IsInBonded/>
    <TaxPreAlgorithmOutput>
      <IsExport>N</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>7021</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
     <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
      </PartyAddress>
    </Party>
   
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>7008</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
      </PartyAddress>
    </Party>
   
  </SellerParty>
  <TermOfDelivery/></arg0></ws:applyTax>
   </soap:Body>
</soap:Envelope>